{"responseHeader":{"status":0,"QTime":187,"params":{"query":"text:Neurology AND mediatype:texts AND -collection:lendinglibrary AND -collection:inlibrary","qin":"Neurology AND mediatype:(texts) AND -collection:lendinglibrary AND -collection:inlibrary","fields":"identifier,title,mediatype,creator,year,description","wt":"json","rows":20,"start":0}},"response":{"numFound":18184,"start":0,"docs":[{"creator":"Logan, Robert J","description":["v, 90 pages : 23 cm","Includes bibliographical references (pages 79-83) and index"],"identifier":"threedimensionso0000loga","mediatype":"texts","title":"The three dimensions of stuttering : neurology, behavior, and emotion","year":1991},{"creator":"Sacks, Oliver, 1933-2015","description":["200 p. : 20 cm","Includes bibliographical references"],"identifier":"vintagesacks0000sack","mediatype":"texts","title":"Vintage Sacks","year":2004},{"description":"This item represents a case in PACER, the U.S. Government's website for federal case data. This information is uploaded quarterly. To see our most recent version please use the source url parameter, linked below. To see the canonical source for this data, please consult PACER directly.","identifier":"gov.uscourts.wvsd.222922","mediatype":"texts","title":"United States v. Search of Business known as \"Neurology & Pain Center, PLLC located at 4501 MacCorkle Ave SE. Suite A, Charleston, Kanawha County, West Virginia"},{"creator":"Defense Technical Information Center","description":"Acute alcohol intoxication (AAI) impairs the hemodynamic counteregulatory response to trauma and hemorrhagic shock (HS), blunts the pressor response to fluid resuscitation (FR), suppresses the HS-induced neuroendocrine response, impairs pro-inflammatory cytokine expression and increases mortality from infection during recovery. Studies conducted during this funding period examined (a) whether the attenuated neuroendocrine response, particularly reduced sympathetic nervous system (SNS) activation, is the principal mechanism responsible for the hemodynamic instability seen in AAI + HS and (b) what the impact of AAI was on the integrity of host defense mechanisms during the immediate and delayed recovery from HS. We determined whether SNS activation can be restored by central (intracerebroventricular; ICV) neostigmine administration and whether this in turn is capable of improving the hemodynamic counteregulatory response to HS in AAI. Our results show that ICV neostigmine stimulates SNS activation and improves the recovery of blood pressure following hemorrhagic shock. Furthermore, our results indicate tht this in part mediated by arginine vasopressin. Interestingly while the presser response to phenylephine in vitro appears to be blunted by alcohol, the in vivo response to a presser with a different mechanism of action appears to be preserved.","identifier":"DTIC_ADA505076","mediatype":"texts","title":"DTIC ADA505076: Alcohol Intoxication Impact on Outcome from Traumatic Injury","year":2009},{"description":"Journal of Behavioral Medicine 1993: Volume 16 , Issue CONTENTS. Digitized from IA1514131-01 . Previous issue: sim_journal-of-behavioral-medicine_1992-12_15_6 . Next issue: sim_journal-of-behavioral-medicine_1993-02_16_1 .","identifier":"sim_journal-of-behavioral-medicine_1993_16_contents","mediatype":"texts","title":"Journal of Behavioral Medicine 1993: Vol 16 Table of Contents","year":1993},{"description":"Journal of Mental Health 2004: Volume 13 , Issue CONTENTS. Digitized from IA1518715-03 . Next issue: sim_journal-of-mental-health_2004-02_13_1 .","identifier":"sim_journal-of-mental-health_2004_13_contents","mediatype":"texts","title":"Journal of Mental Health 2004: Vol 13 Table of Contents","year":2004},{"description":"Mental Hospitals 1956-11: Volume 7 , Issue 9. Digitized from IA1513721-01 . Previous issue: sim_psychiatric-services_1956-10_7_8 . Next issue: sim_psychiatric-services_1956-12_7_10 .","identifier":"sim_psychiatric-services_1956-11_7_9","mediatype":"texts","title":"Mental Hospitals 1956-11: Vol 7 Iss 9","year":1956},{"description":["1 online resource (xi, 406 pages) :","Includes bibliographical references and indexes","Print version record","Electronic reproduction. [Place of publication not identified] : HathiTrust Digital Library","Master and use copy. Digital master created according to Benchmark for Faithful Digital Reproductions of Monographs and Serials, Version 1. Digital Library Federation, December 2002","digitized 2011"],"identifier":"magneticsourceim0000unse","mediatype":"texts","title":"Magnetic source imaging of the human brain","year":2003},{"description":["xxi, 622 p. : 26 cm","Originally published: Cambridge, Mass. : MIT Press, 1975","Proceedings of a symposium held at the Massachusetts Institute of Technology, Oct. 29-30, 1973","Includes bibliographical references and indexes"],"identifier":"neurosciencespat0000unse","mediatype":"texts","title":"The Neurosciences : paths of discovery I","year":1992},{"description":"adsf","identifier":"TheSlaveTradeCarey1853_201903","mediatype":"texts","title":"The Slave Trade Carey 1853"},{"description":["ix, 344 pages : 25 cm","Includes bibliographical references and index","Epilepsy and syncope. Juvenile myoclonic epilepsy : under-appreciated and under-diagnosed / R. Renganathan and N. Delanty ; Sudden unexpected death in epilepsy / S.D. Lhatoo, Y. Langan and J.W.A.S. Sander ; Important points in the clinical evaluation of patients with syncope / W. Arthur and G.C. Kaye ; The approach to the patient with 'non-epileptic seizures' / J.D.C. Mellers ; The management of epilepsy in women / M.D. O'Brien and S.K. Gilmour-White ; Approach to the patient with epilepsy in outpatient department / S. Handjikoutis and P.E.M. Smith -- Infectious and para-infectious disease. Subacute sclerosing panencephalitis / R.K. Garg ; Tuberculosis of the central nervous system / R.K. Garg ; Diagnosis and treatment of viral encephalitis / A. Chaudhuri and P.G.E. Kennedy ; Acute disseminated encephalomyelitis / R.K. Garg -- Neurodegeneration and neuroinflammation. Management of motor neurone disease / R.S. Howard and R.W. Orrell ; Motor neurone disease / K. Talbot ; Progressive supranuclear palsy (Steel-Richardson-Olszewski disease) / H.R. Morris, N.W. Wood and A.J. Lees ; Pharmacological treatment of Parkinson's disease / A. Münchau and K.P. Bhatia with S.A. Schneider ; Young onset dementia / E.L. Sampson, J.D. Warren and M.N. Rossor ; Multiple sclerosis : diagnosis and management of acute relapses / S.M. Leary, B. Porter and A.J. Thompson -- Stroke. Migraine, memory loss and 'multiple sclerosis' : neurological features of the antiphospholipid (Hughes') syndrome / G.R.V. Hughes ; Chronic subdural haematoma in the elderly / V. Adhiyaman, M. Asghar, K.N. Ganeshram and B.K. Bhowmick ; Management of stroke / R. McGovern and A.G. Rudd ; Management of neurogenic dysphagia / A.M.O. Bakheit ; Pathophysiology and clinical aspects of breathing after stroke / R.S. Howard, A.G. Rudd, C.D. Wolfe and A.J. Williams ; Thrombolysis in acute ischaemic stroke / A.C. Pereira, P.J. Martin and E.A. Warburton"],"identifier":"neurologyupdater0000unse","mediatype":"texts","title":"Neurology update : reviews for continuing professional development","year":2006},{"description":"asdf","identifier":"MampaeyLucLeProgrammeHAARP","mediatype":"texts","title":"Mampaey Le Programme HAARP nwo illuminati freemasons"},{"description":"Extracts from Springmeier book","identifier":"ManchurianCandidateFrankSinatraRatPackSirhanSirhan_201903","mediatype":"texts","title":"Manchurian Candidate Frank Sinatra Rat Pack Sirhan Sirhan nwo illuminati freemasons Springmeier"},{"creator":"Defense Technical Information Center","description":"The effect of attention on visual perception has been a subject of great controversy. Much research on attention over the last thirty years has been framed by the debate on this question between proponents of early and late selection. Late selection theorists have argued that all perceptual encoding, including recognition, and certain semantic analyses are accomplished in parallel, while early selection theorists have countered that only simple 'physical' analyses can be conducted in parallel. More sophisticated analyses of shape that support object recognition and memory access are conducted by limited capacity systems. Although the terms 'perceptual' and 'semantic' include a wide variety of processes, there has been an unfortunate tendency to extrapolate conclusions to the entire collection of processes based on results from a few. For example, researchers have tacitly assumed that if any evidence for semantic processing of unattended material is found, then perceptual operations must be parallel. This inference, however, only applies to the perceptual operations relevant to the recognition of the experimental stimuli, which are generally upright block alphanumeric characters. Recognition of these stimuli does not require the resolution of a vast number of problems the visual system must solve: the analysis of motion, three-dimensional space, constancies of various sorts, etc.","identifier":"DTIC_ADA206452","mediatype":"texts","title":"DTIC ADA206452: Relating Attention to Visual Mechanisms","year":1989},{"creator":"Defense Technical Information Center","description":"How does the brain perform cognitive tasks? This chapter approaches the general issue by outlining a computational model of visual-spatial attention. Studies of alert animals, brain injured patients and normals suggest that components of this model are performed by separate cortical and midbrain systems which are orchestrated to produce covert attentional shifts. These findings suggest a distributed network view of visual-spatial orienting with the cognitive operations performed in different anatomical locations. Attention to visual, auditory and tactile modalities appear to involve separate anatomical systems at the lowest level. At a higher level attention can be allocated to a common cognitive system for spatial location. Studies of non-visual spatial attention suggest that this higher level also involves the parietal cortex. Further studies suggest the presence of attentional systems which go beyond any single cognitive domain (e.g. spatial). However, our results show that attention to non-spatial language information does not involve the parietal system so important for spatial orienting. (Author)","identifier":"DTIC_ADA157540","mediatype":"texts","title":"DTIC ADA157540: Cognitive Science Program. Hierarchical Distributed Networks in the Neuropsychology of Selective Attention.","year":1985},{"creator":"Defense Technical Information Center","description":"The natural history of both cognitive functioning and T2-hyperintensities is being examined in a longitudinal study of a cohort of 32 patients with NF1 and 11 controls. Follow-up neuropsychological assessments and cranial MRIs were performed after an 8-year period. Preliminary data analysis suggests that there is no improvement in cognitive function over time. MRI T2-hyperintensities decrease in size, intensity and number over time. However lesions in the basal ganglia behave differently from lesions in the cortex and brainstem, suggesting different underlying pathogenetic mechanisms. The timing of the MRI scan appears important in terms of its ability to predict cognitive deficits. In addition, we are conducting a comprehensive neuropsychological study of a cohort of 80 children with NF1 and 50 sibling controls. Patient ascertainment and testing is still in progress. These children (8-16 years) will undergo intensive cognitive assessments and MRIs. The relationship between T2-hyperintensities on cranial MRI and neuropsychological functioning will be examined by determining whether the number, size, or sites of these lesions are predictive of general or specific neuropsychological deficits. A multicentre study is also being conducted to characterise the distribution of IQ scores in a large international cohort of patients with NF1 and to determine whether any clinical or demographic variables are associated with lowering of IQ.","identifier":"DTIC_ADA399153","mediatype":"texts","title":"DTIC ADA399153: Profile of the Neurofibromatosis Type 1 (NF1) Phenotype: Natural History, Neuropsychological and Psychosocial Aspects","year":2001},{"identifier":"gov.uscourts.mad.90025","mediatype":"texts","title":"gov.uscourts.mad.90025"},{"creator":"Defense Technical Information Center","description":"The long term goals of this research are to understand the mechanisms by which NF1 and its partners control growth using the Drosophila peripheral nerve as our assay system. This system is advantageous because we can apply a number of powerful molecular genetic methodologies that are not available in other systems. For task #3, we used RNA interference to generate preliminary evidence that push acts in the peripheral glia to control perineurial glial growth. This preliminary finding will be pursued in much greater detail during the next funding period. Our major findings continue to be generated from aim #4. Our finding, reported last year, that Ras nonautonomously activates perineurial glial growth via PI3 Kinase, Akt and FOXO, was published in the Journal of Neuroscience. During this funding period we found evidence for a role for the Akt-regulated Tor pathway in regulating glial growth: for example, expression of a dominant-negative S6 kinase suppressed the increased glial growth conferred by PI3K-CAAX. This and other observations raise the possibility that Tor and FOXO interact to control glial growth. We also report evidence that the Ras-activated Ral GTPase participates with PI3K inglial growth control.","identifier":"DTIC_ADA515523","mediatype":"texts","title":"DTIC ADA515523: Control of Growth Within Drosophila Peripheral Nerves by Ras and Protein Kinase A","year":2007},{"description":"Transactional Analysis Journal 1984: Volume 14 , Issue Index. Digitized from IA1627601-01 . Previous issue: sim_transactional-analysis-journal_1985-10_15_4 . Next issue: sim_transactional-analysis-journal_1986-01_16_1 .","identifier":"sim_transactional-analysis-journal_1984_14_index","mediatype":"texts","title":"Transactional Analysis Journal 1984: Vol 14 Index","year":1984},{"description":["2 volumes (xviii, 1301, xlvi pages) : 29 cm","Includes bibliographical references and index"],"identifier":"neurosurgeryscie0001unse","mediatype":"texts","title":"Neurosurgery : the scientific basis of clinical practice","year":2000}]}}