{"responseHeader":{"status":0,"QTime":64,"params":{"query":"((text:business text:psychology) OR text:&quot;business psychology&quot;) AND mediatype:texts AND -collection:lendinglibrary AND -collection:inlibrary","qin":"business psychology AND mediatype:(texts) AND -collection:lendinglibrary AND -collection:inlibrary","fields":"identifier,title,mediatype,creator,year,description","wt":"json","rows":20,"start":0}},"response":{"numFound":4669,"start":0,"docs":[{"creator":"Wellin, Michael","description":["xvi, 242 p. : 25 cm","Includes index","Introduction and why the psychological contract matters -- Current use of the psychological contract -- Viewing the psychological contract as a personal deal -- Making and breaking personal deals -- The personal deal process -- Types of personal deal -- How three companies use the psychological contract -- Using the personal deal to improve leadership effectiveness -- Using the personal deal to change organisation culture -- How human resources practitioners manage personal deals -- How to shape your personal deals -- Behavioural view of the personal deal"],"identifier":"managingpsycholo0000well","mediatype":"texts","title":"Managing the psychological contract : using the personal deal to increase business performance","year":2007},{"creator":"Horn, Art","description":["1 online resource (150 pages)","We all want to be accountable, to be responsible, to reveal genuine commitment. We all want to keep on track with our word and stay away from blame. But organizational systems meant to institutionalize accountability often don't help us accomplish those necessary goals. Throw Your Stuff Off the Plane will","Print version record","Cover -- endoresements -- Title -- Copyright' -- Ded -- Epi -- Contents -- Preface -- Intro -- CH1 -- CH2 -- CH3 -- CH4 -- CH5 -- CH6 -- CH7 -- CH8 -- CH9 -- ACK -- Notes","Includes bibliographical references and index"],"identifier":"throwyourstuffof0000horn","mediatype":"texts","title":"Throw Your Stuff Off the Plane : Achieving Accountability in Business and Life","year":2017},{"creator":"Antonietti, Alessandro","identifier":"theoryofmindlang0000anto","mediatype":"texts","title":"Theory of Mind and Language in Developmental Contexts","year":2006},{"creator":"Defense Technical Information Center","description":"The Corps spends billions of dollars annually on projects in its Civil Works program. Part of the cost of doing business with the Corps involves paying for overhead -- costs that do not directly relate to a specific project or activity but more generally support agency operations. Overhead costs are included in the amount that Congress appropriates for specific Corps projects and the amount that customers pay for Corps' services. The Corps provides services to customers including other Department of Defense units, federal agencies, state and local governments, Indian tribes, and foreign governments. The Corps' Civil Works program is organized around its headquarters, 8 divisions, and 38 districts nationwide. Only district overhead is charged to projects; overhead for headquarters and divisions is not. You asked GAO to review the Corps' process for building overhead costs into projects. This report examines the following: (1) how the Corps builds overhead costs into its projects, and (2) customers' views on overhead information. To accomplish this, GAO reviewed the Corps' documentation of its overhead and billing processes; interviewed officials at Corps headquarters, 2 divisions, and 4 districts based on geographic location; and interviewed 16 of the highest paying federal and nonfederal Corps' customers in fiscal year 2012. The results of these interviews cannot be generalized to all customers but provided insights. GAO is not making recommendations in this report. The Department of Defense did not provide comments.","identifier":"DTIC_ADA581003","mediatype":"texts","title":"DTIC ADA581003: U.S. Army Corps of Engineers: Building Overhead Costs into Projects and Customers' Views on Information Provided","year":2013},{"creator":"Wells, Helen, 1977-","description":["1 online resource (vii, 231 pages)","The Fast and The Furious: Drivers, Speed Cameras and Control in a Risk Society offers an explanation for the continued debate about one road safety intervention - the speed camera - by situating that debate within contemporary literature about the 'risk society' (Beck, 1992) and more broadly understood experiences of risk faced on a daily basis by drivers. Rather than a focus on risk as something that can be objectively assessed, measured and managed separately from the social context in which it is encountered, it suggests that 'risk' is something that permeates this particular debate from ev","Includes bibliographical references (pages 205-224) and index","Cover; Contents; Acknowledgements; 1 Introduction; 2 A Brief History of Speed Limit Enforcement; 3 Contradictory Expert Claims about Speed Cameras; 5 Respectability, Responsibility and Resistance; 6 Experiencing Automated Enforcement; 7 Developments -- Past, Present and Future; 8 Conclusion; Glossary; Bibliography; Index","Print version record"],"identifier":"fastfuriousdrive0000well","mediatype":"texts","title":"The fast and the furious : drivers, speed cameras and control in a risk society","year":2012},{"creator":"Hadfield, Sue","description":["vii, 175 pages : 20 cm","\"A self-help manual on creating reasonable, achievable improvement in your lifeIn our attempts to overachieve, many people find themselves frustrated because they cannot relish in their own successes. Though these professionals may reach their goals of job titles and financial stability, they often sacrifice their personal and family lives and discover deep dissatisfaction. In Change One Thing!, self-help author Sue Hadfield outlines the necessary steps to address the disillusionment that has become a common problem in our work-driven society. While whirlwind change can be overwhelming and unrealistic for a modern worker with a family and responsibilities, Hadfield asserts that a determined person can bring about an impactful change in his life by simply altering one aspect of it. Teaches readers to avoid emotions of hopelessness and panic associated with changing too many aspects at once Details a step-by-step plan to make a meaningful change Shares real-life examples of people who successfully altered their lives Those who recognize that professional success is less fulfilling than other facets of their lives will find comfort and guidance in Change One Thing! as they embark on missions to improve their lives\"--","Includes bibliographical references and index"],"identifier":"changeonethingma0000hadf","mediatype":"texts","title":"Change one thing : make one change and embrace a happier, more successful you","year":2014},{"creator":["Kuhn, Robert Lawrence","Geis, George T"],"description":["\"Praeger special studies. Praeger scientific.\"","Bibliography: p. 203","Includes index"],"identifier":"firmbondlinkingm00kuhn","mediatype":"texts","title":"The firm bond : linking meaning and mission in business and religion","year":1984},{"creator":"Holman, Rebecca, author","description":["230 pages ; 24 cm","Embrace your inner Beta and get ahead on your own terms.What does success look like? 5AM conference calls and late nights in the office? Winning every argument in the office and always getting your own way? What does a successful woman look like? The shoulder-pad wearing Alpha? The dogmatist who rules with an iron fist?The reality is far more nuanced. Yet women are still reduced to Alpha boss, or the Beta secretary or assistant but when 47% of the workforce are reduced to two unhelpful stereotypes, how can you embrace your inner Beta and be a success on your own terms?It's an important question because the world is changing, fast. Successful companies need people who can lead with emotional intelligence, be flexible to new ideas and adapt their plans when required, leaving their ego at the door. The Beta woman's time is now.Beta celebrates the collaborators, the pragmatists, and the people who believe that being nice works and getting your own way isn't always the most important thing. It is a call-to-arms that explores the unsung workforce of Beta women who are being great bosses, great leaders and are still living their own lives: having relationships, making time for friends, having families. Beta inspires confidence and will help you in the workplace.Fully researched and rich with interviews, anecdotes and case studies, Beta will be a smart and entertaining read that really explores the role of women in the workplace today","\"There is more than one way to be the boss\""],"identifier":"betaquietgirlsca0000holm","mediatype":"texts","title":"Beta : quiet girls can run the world","year":2017},{"description":"Journal of Youth and Adolescence 1981: Volume 10 , Issue Contents. Digitized from IA1534529-04 . Previous issue: sim_journal-of-youth-and-adolescence_1981_10_index . Next issue: sim_journal-of-youth-and-adolescence_1981-02_10_1 .","identifier":"sim_journal-of-youth-and-adolescence_1981_10_contents","mediatype":"texts","title":"Journal of Youth and Adolescence 1981: Vol 10 Table of Contents","year":1981},{"description":"Journal of Behavioral Medicine 1993: Volume 16 , Issue CONTENTS. Digitized from IA1514131-01 . Previous issue: sim_journal-of-behavioral-medicine_1992-12_15_6 . Next issue: sim_journal-of-behavioral-medicine_1993-02_16_1 .","identifier":"sim_journal-of-behavioral-medicine_1993_16_contents","mediatype":"texts","title":"Journal of Behavioral Medicine 1993: Vol 16 Table of Contents","year":1993},{"description":"Journal of Business and Psychology 2003 - 2004: Volume 18 , Issue CONTENTS. Digitized from IA1566719-06 . Previous issue: sim_journal-of-business-and-psychology_summer-2003_17_4 . Next issue: sim_journal-of-business-and-psychology_fall-2003_18_1 .","identifier":"sim_journal-of-business-and-psychology_2003-2004_18_contents","mediatype":"texts","title":"Journal of Business and Psychology 2003 - 2004: Vol 18 Table of Contents","year":2003},{"description":"Lifestyles 1989: Volume 10 , Issue Index. Digitized from IA1643502-04 . Previous issue: sim_journal-of-family-and-economic-issues_winter-1988_9_4 . Next issue: sim_journal-of-family-and-economic-issues_spring-1989_10_1 .","identifier":"sim_journal-of-family-and-economic-issues_1989_10_index","mediatype":"texts","title":"Lifestyles 1989: Vol 10 Index","year":1989},{"creator":"Tan, Amy, author","description":["xiv, 589 pages ; 24 cm","Violet Minturn, a half-Chinese/half-American courtesan who has honed her ability to become any man's fantasy since her start as a \"Virgin Courtesan\" at the age of twelve, struggles to find her place in the world, while her mother, Lucia, tries to make sense of the choices she has made and the men who have shaped her. Violet is the privileged daughter of the American madam of the city's most exclusive courtesan house. But when the Ching dynasty is overturned, Violet is separated from her mother in a cruel act of chicanery and forced to become a \"virgin courtesan.\" Half-Chinese and half-American, she grapples with her place in the worlds of East and West, until she is able to merge her two halves, empowering her to become a shrewd courtesan who excels in the business of seduction and illusion, though she still struggles to understand who she is. Back in 1897 San Francisco, Violet's mother, Lucia, chooses a disastrous course as a sixteen-year-old, when her infatuation with a Chinese painter compels her to leave her home for Shanghai. Shocked by her lover's adherence to Chinese traditions, she is unable to change him, despite her unending American ingenuity. Fueled by betrayals, both women refuse to submit to fate and societal expectations, persisting in their quests to recover what was taken from them: respect; a secure future; and, most poignantly, love from their parents, lovers, and children. To reclaim their lives, they take separate journeys, to a backwater hamlet in China, the wealthy environs of the Hudson River Valley, and, ultimately, the unknown areas of their hearts, where they discover what remains after their many failings to love and be loved. Spanning more than forty years and two continents, this novel transports readers from the collapse of China's last imperial dynasty to the beginning of the Republic and recaptures the lost world of old Shanghai through the inner workings of courtesan houses and the lives of the foreigners living in the International Settlement, both erased by World War II","Hidden jade path -- The new republic -- The hall of tranquility -- Etiquette for beauties of the boudoir -- The memory of desire -- A singing sparrow -- A blue disease -- The two Mrs. Ivorys -- Quicksand years -- Moon Pond village -- Heaven Mountain -- The valley of amazement -- Fata morgana -- Shanghailanders -- The city at the end of the sea"],"identifier":"valleyofamazemen0000tana_j5a9","mediatype":"texts","title":"The valley of amazement","year":2013},{"creator":"Benfari, Robert","description":["Includes bibliographical references (pages 271-273) and index","Introduction: What Makes a Good Manager? Part One: A Model for Change -- The Dynamics of Management Style: What Can Be Changed? -- Personality and Psychology: What's Your Type? -- Practical Intelligence: How Do We Make It Work? -- Mental Models: How Do We Make the Shift? -- Part Two: The Elements of Management Style -- Needs: The Drive Towards Competence -- Power Bases: Influence, Authority, and Expertise -- Problem Solving and Conflict Management: Catalysts for Change -- Values: Clarifying What You Stand For -- Stress: Managing Work and Difficult People -- Putting It All Together: Developing an Action Plan for Your Management Style","Are the best managers born that way, while the rest of us must struggle with the role and its responsibilities? According to Robert Benfari, our ability to manage effectively is based on a mix of characteristics that can be analyzed, understood and, most importantly, changed. In this book, he identifies six ingredients of successful management and uses the Myers-Briggs Type Indicator to show readers how they can devise personality-specific strategies for improving their ability to resolve conflict, solve problems, manage stress, positively influence others, and handle difficult situations at work.--Publisher description"],"identifier":"understandingcha00robe","mediatype":"texts","title":"Understanding and changing your management style","year":1999},{"creator":"Zumbach, Jörg","identifier":"beyondknowledgel0000zumb","mediatype":"texts","title":"Beyond Knowledge: The Legacy of Competence Meaningful Computer-based Learning Environments","year":2008},{"creator":"Harding, Christopher, 1951-","description":["xiii, 284 p. : 24 cm","Includes bibliographical references (p. 272-279) and index","Introduction: searching for the responsible criminal actor -- The organisation in contemporary society -- Agency: the philosophy of the collective -- Legal routes to responsibility -- Models of responsibility -- Human or corporate? Allocating responsibility for business conspiracy -- Delinquency within structures of governance -- The legal control of criminal organisations -- The organisation as an autonomous criminal actor -- The criminal enterprise as a facilitating framework"],"identifier":"criminalenterpri0000hard","mediatype":"texts","title":"Criminal enterprise : individuals, organisations and criminal responsibility","year":2007},{"creator":"Johnston, Russell T. (Russell Todd), 1967-","description":["1 online resource (viii, 355 pages) :","\"From its origins in the Victorian era as a marginal and somewhat shady enterprise, the advertising trade in Canada changed radically after the turn of the century - rising quickly to a position of influence and respectability. In this book, Russell Johnston tells the story of the people who made it so.\" \"Johnston's setting is the dynamic intersection of business and culture during the early decades of the twentieth century. During this period, he argues, magazines and newspapers grew increasingly dependent on sales of advertising space, and this precipitated a widespread restructuring of the publishing industry. Ultimately, this affected the range and content of Canadian periodicals, setting the parameters for a newly invigorated, though still fragile, Canadian magazine industry. Johnston charts this process by exploring the lives, goals, and ideas of a new breed of solicitor, the ad agent, and shows how agencies began to draw on the disciplines of psychology and economics to promote their products, thus initiating the modern market research industry.\" \"The only thorough analysis of the forces shaping advertising in Canada prior to 1930, this study documents the emergence of a key component of the modern culture of consumption.\"--Jacket","Includes bibliographical references (pages 283-348) and index","Print version record","Intro -- Contents -- Acknowledgments -- Introduction -- 1. Newspapers, Advertising, and the Rise of the Agency, 1850-1900 -- 2. Toronto Adworkers -- 3. A Professional Ideal -- 4. The Industry Takes Shape, 1900-1921 -- 5. Copywriting, Psychology, and the Science of Advertising -- 6. Market Research and the Management of Risk -- 7. The Canadian Market, Magazines, and the New Logic of Advertising -- Conclusion -- Appendix -- Notes -- Selected Bibliography -- Index -- A -- B -- C -- D -- E -- F -- G -- H -- I -- J -- K -- L -- M -- N -- O -- P -- Q -- R -- S -- T -- V -- W"],"identifier":"sellingthemselve0000john","mediatype":"texts","title":"Selling themselves : the emergence of Canadian advertising","year":2001},{"creator":"Stewart, Alison, 1966- author","description":["xx, 284 pages : 24 cm","\"Junk has become ubiquitous in America today. Who doesn't have a basement, attic, closet, or storage unit filled with stuff too good to throw away? Or, more accurately, stuff you think is too good to throw away. When journalist and author Alison Stewart was confronted with emptying her late parents' overloaded basement, a job that dragged on for months, it got her thinking: How did it come to this? Why do smart, successful people hold on to old Christmas bows, chipped knick-knacks, VHS tapes, and books they would likely never reread? She discovered she was not alone. Junk details Stewart's three-year investigation into America's stuff, lots and lots and lots of stuff. Stewart rides along with junk removal teams from around the country such as Trash Daddy, Annie Haul, and Junk Vets. She goes backstage to a taping of Antiques Roadshow, and learns what makes for compelling junk-based television with the executive producer of Pawn Stars. And she even investigates the growing problem of space junk--23,000 pieces of manmade debris orbiting the planet at 17,500 mph, threatening both satellites and human space exploration. But it's not all dire. There are creative solutions to America's overburdened consumer culture. Stewart visits with Deron Beal, founder of FreeCycle, an online community of people who would rather give away than throw away their no-longer-needed possessions. She spends a day at a Repair Cafe, where volunteer tinkerers bring new life to broken appliances, toys, and just about anything. Stewart also explores communities of \"tiny houses\" without attics and basements in which to stash the owners' trash. Junk is a delightful journey through 250-mile-long yard sales, and packrat dens, both human and rodent, that for most readers will look surprisingly familiar\"--","\"When journalist and author Alison Stewart was confronted with emptying her late parents' overloaded basement, a job that dragged on for months, it got her thinking: How did it come to this? Why do smart, successful people hold on to old Christmas bows, chipped knick-knacks, VHS tapes, and books they would likely never reread? Junk details Stewart's three-year investigation into America's stuff. She rides along with junk removal teams like Trash Daddy, Annie Haul, and Junk Vets. She goes backstage to a taping of Antiques Roadshow, and learns what makes for compelling junk-based television with the executive producer of Pawn Stars. And she even investigates the growing problem of space junk--23,000 pieces of manmade debris orbiting the planet at 17,500 MPH, threatening both satellites and human space exploration\"--","Includes bibliographical references and index","What is it? -- Who has it? And why? -- When did it become big business? -- Where should it go? -- How can you use it, fix it, or love it?"],"identifier":"junkdiggingthrou0000stew","mediatype":"texts","title":"Junk : digging through America's love affair with stuff","year":2016},{"creator":"Schwab, Klaus, 1938-","description":"Includes bibliographical references and index","identifier":"overcomingindiff00klau","mediatype":"texts","title":"Overcoming indifference : ten key challenges in today's changing world : a survey of ideas and proposals for action on the threshold of the twenty-first century","year":1995},{"description":"Animal Learning & Behavior 1974: Volume 2 , Issue INDEX/CONTENTS. Digitized from IA1533802-01 . Previous issue: sim_learning-behavior_1973-11_1_4 . Next issue: sim_learning-behavior_1974-02_2_1 .","identifier":"sim_learning-behavior_1974_2_index-contents","mediatype":"texts","title":"Animal Learning & Behavior 1974: Vol 2 Index & Table of Contents","year":1974}]}}