{"count":147,"next":"https://gutendex.com/books/?page=2&search=language","previous":null,"results":[{"id":3206,"title":"Moby Multiple Language Lists of Common Words","authors":[{"name":"Ward, Grady","birth_year":1951,"death_year":null}],"summaries":["\"Moby Multiple Language Lists of Common Words\" by Grady Ward is a compilation of word lists written in the early 21st century. This resource serves as a linguistic reference, featuring extensive vocabulary lists in several prominent languages, including French, German, Italian, Japanese, and Spanish. The aim of the book is to provide users with a comprehensive set of common words to aid in language study and usage.  The content of this book comprises five language-specific lists, each enumerating a significant number of words in its respective language. For example, the French list contains over 138,000 words, while the German list boasts nearly 160,000. Each list is structured in a simple, accessible text format, making it easy for users to reference and utilize. Additionally, the book outlines instructions on how to download and access the files, emphasizing their public domain status and the utility of these lists for linguistic purposes. Overall, the work serves as a practical tool for language learners and linguists seeking to expand their vocabulary across multiple languages. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Words and phrase lists -- English"],"bookshelves":["Category: Encyclopedias/Dictionaries/Reference","Category: Language & Communication"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/3206.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/3206.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/3206.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/3206.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/3206.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/3206/pg3206.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/files/3206/files.zip"},"download_count":18309},{"id":39647,"title":"Heath's Modern Language Series: The Spanish American Reader","authors":[{"name":"Nelson, Ernesto","birth_year":null,"death_year":null}],"summaries":["\"Heath's Modern Language Series: The Spanish American Reader\" by Ernesto Nelson is a collection of educational texts written in the early 20th century. This work aims to enrich the study of the Spanish language by providing insights into the customs, geography, and commerce of Spanish-speaking countries in the Americas. The book serves as a resource for students and educators, highlighting the cultural and economic connections between the Americas and Spain.  The opening of the reader begins with a foreword by the author, discussing the need for better educational materials that adequately portray the realities of Spanish America and cater to students' interests. Nelson emphasizes the importance of understanding the diverse environments, commercial activities, and the societal aspects of Spanish-speaking countries beyond what traditional textbooks offer. This section sets the stage for the subsequent chapters, which explore various topics such as housing, commerce, and social practices, all while integrating language lessons designed to engage and educate students effectively. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Spanish language -- Readers"],"bookshelves":["Category: Language & Communication","Category: Teaching & Education","Category: Travel Writing"],"languages":["en","es"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/39647.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/39647.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/39647.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/39647.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/39647.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/39647/pg39647.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/files/39647/39647-8.zip"},"download_count":4803},{"id":31591,"title":"Language of Flowers","authors":[{"name":"Greenaway, Kate","birth_year":1846,"death_year":1901}],"summaries":["\"Language of Flowers\" by Kate Greenaway is a beautifully illustrated collection that blends botany with poetic expression, likely written during the late 19th century. This book serves as a charming exploration of the meanings attributed to various flowers, revealing the language of flowers and their symbolism throughout history. This enchanting work captures the essence of floral communication, offering readers a glimpse into how flowers convey emotions and sentiments.  The book presents an extensive alphabetical compilation of flowers, each accompanied by a brief description of its symbolic meaning. For example, the rose represents love, while the daisy epitomizes innocence. Interspersed with illustrations, the text creates a vivid tapestry of vivid imagery and sentiment, serving as both a reference for flower meanings and an aesthetic celebration of nature's beauty. Through its careful curation, \"Language of Flowers\" invites readers to not only appreciate the blooms but also to understand the deeper connections between flora and human emotions. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Flower language","Flowers -- Poetry"],"bookshelves":["Category: Art","Category: Encyclopedias/Dictionaries/Reference","Category: Nature/Gardening/Animals"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/31591.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/31591.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/31591.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/31591.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/31591.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/31591/pg31591.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/files/31591/31591-8.zip"},"download_count":4112},{"id":28553,"title":"How it Works: Dealing in simple language with steam, electricity, light, heat, sound, hydraulics, optics, etc., and with their applications to apparatus in common use","authors":[{"name":"Williams, Archibald","birth_year":1871,"death_year":1934}],"summaries":["\"How It Works\" by Archibald Williams is a scientific publication written in the early 20th century. The work aims to explain the fundamental principles behind various physical phenomena and mechanisms encountered in daily life, such as steam, electricity, and sound, using simple language that caters to an audience without an in-depth technical background.   At the start of the text, the author shares his motivation for writing, noting the frequency of questions he has received asking for clarification on how various devices operate. He indicates that the text will cover a range of topics, including steam engines, electrical apparatus, and optics, with a focus on fundamental principles rather than exhaustive technical specifics. It includes illustrations and diagrams to enhance understanding, illustrating how common mechanisms function, such as the steam engine's operations, safety measures for boilers, and a comparison of natural organs to man-made machines, signaling a clear intent to demystify complex scientific concepts for the uninitiated. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Science -- Juvenile literature","Technology -- Juvenile literature"],"bookshelves":["Category: Engineering & Technology","Category: How To ...","Category: Science - Physics","Manufacturing","Technology"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/28553.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/28553.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/28553.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/28553.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/28553.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/28553/pg28553.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/files/28553/28553-8.zip"},"download_count":3605},{"id":65775,"title":"The Cry for Justice: An Anthology of the Literature of Social Protest: The writings of philosophers, poets, novelists, social reformers, and others who have voiced the struggle against social injustice; selected from twenty-five languages; covering a period of five thousand years","authors":[],"summaries":["\"The Cry for Justice: An Anthology of the Literature of Social Protest\" edited by Upton Sinclair is a collection of literary works spanning many genres, written in the early 20th century. The anthology features writings from philosophers, poets, novelists, and social reformers who advocate against social injustice, reflecting the struggles of humanity across various cultures and time periods. The central theme revolves around the outcry for justice in the face of systemic oppression and the plight of the working class throughout history.  The opening of the anthology establishes a foundational context by introducing the concept of social protest through a powerful dedication and a profound introduction by Jack London. Sinclair, in the preface, underscores the significance of unifying voices from different times and places to address issues of inequality, exploitation, and the human condition. He emphasizes that the collection seeks to uplift those who have labored under the weight of injustice, illustrating the hardship faced by the oppressed while simultaneously offering their cries for change and hope for a better world. This anthology serves as both a historical account of social dissent and a rallying cry for future action in the pursuit of equity and understanding among all people. (This is an automatically generated summary.)"],"editors":[{"name":"Sinclair, Upton","birth_year":1878,"death_year":1968}],"translators":[],"subjects":["Social justice","Social problems"],"bookshelves":["Category: Essays, Letters & Speeches","Category: Politics","Category: Sociology"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/65775.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/65775.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/65775.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/65775.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/65775.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/65775/pg65775.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/cache/epub/65775/pg65775-h.zip"},"download_count":3421},{"id":43376,"title":"The American Language: A Preliminary Inquiry into the Development of English in the United States","authors":[{"name":"Mencken, H. L. (Henry Louis)","birth_year":1880,"death_year":1956}],"summaries":["\"The American Language\" by H. L. Mencken is a critical inquiry into the development of English as it is spoken in the United States, written in the early 20th century. The book explores the distinct differences in vocabulary, grammar, pronunciation, and usage between American English and British English, as observed by the author through his extensive experience as a journalist and editor. It aims to address the lack of comprehensive literature on the subject, filling a gap by articulating the unique features that define American English.  At the start of the work, Mencken delves into his motivation for writing, noting the inadequacy of existing literature regarding the differences between American and British English. He references historical figures such as Thomas Jefferson and Noah Webster, who anticipated the evolution of a distinctly American dialect, emphasizing the influence of American culture, environment, and innovation. Mencken outlines the neglect of American vernacular by scholars and the need for a deeper understanding and acceptance of American English as a legitimate and evolving language distinct from its British roots. The opening sets the stage for a thorough exploration of topics such as pronunciation, slang, and the impact of immigration on the language. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Americanisms","English language","Names -- United States","Names, Personal -- United States"],"bookshelves":["Category: American Literature","Category: Language & Communication"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/43376.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/43376.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/43376.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/43376.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/43376.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/43376/pg43376.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/cache/epub/43376/pg43376-h.zip"},"download_count":2978},{"id":27738,"title":"Heath's Modern Language Series: José","authors":[{"name":"Palacio Valdés, Armando","birth_year":1853,"death_year":1938}],"summaries":["\"José\" by Armando Palacio Valdés is a novel written in the late 19th century. The story is set in the coastal fishing village of Rodillero and revolves around the life of the main character, José, who struggles against the hardships posed by his vixenish mother and the unforgiving nature of the sea, all in pursuit of his beloved, Elisa. Through the narrative, Valdés portrays themes of love, familial conflict, and the daily toil of the fishing community.  At the start of the novel, readers are introduced to the picturesque yet rugged setting of Rodillero, a fishing village that is intricately woven into the life of its inhabitants. As José engages in his daily routine, we learn of his difficult upbringing under the harsh rule of his mother, Teresa, who was scarred by betrayal and raises him with an iron fist. The opening scenes depict the camaraderie among fishermen at sea, contrasted with the complexities of life on land, particularly concerning José's romantic feelings for Elisa, the daughter of the local schoolmaster. This blend of daily struggles, vibrant character dynamics, and budding romance sets the stage for a rich exploration of human resilience in the face of adversity. (This is an automatically generated summary.)"],"editors":[{"name":"Davidson, Frederick Joseph Arthur","birth_year":1870,"death_year":null}],"translators":[],"subjects":["Spanish language -- Textbooks for foreign speakers -- English"],"bookshelves":["Category: Novels"],"languages":["es"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/27738.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/27738.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/27738.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/27738.txt.utf-8","application/octet-stream":"https://www.gutenberg.org/files/27738/27738-page-images/f0000-image1.jpg","application/rdf+xml":"https://www.gutenberg.org/ebooks/27738.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/27738/pg27738.cover.medium.jpg"},"download_count":2823},{"id":41915,"title":"Hossfeld's Spanish Dialogues, and Idiomatic Phrases Indispensible for a Rapid Acquisition of the Spanish Language","authors":[{"name":"Cornett, W. N. (William N.)","birth_year":null,"death_year":null},{"name":"Hossfeld, C.","birth_year":null,"death_year":null}],"summaries":["\"Hossfeld's Spanish Dialogues, and Idiomatic Phrases Indispensable for a Rapid Acquisition of the Spanish Language\" by W. N. Cornett is a language learning guidebook likely written in the early 20th century. This resource is designed to help students quickly gain conversational proficiency in Spanish through the use of dialogues and essential phrases. The emphasis on idiomatic expressions suggests that readers will not only learn the language but also understand cultural nuances.  The opening of this guide introduces the importance of effective dialogue in language acquisition, detailing how the book has been revised to better serve learners. It includes an extensive table of contents that outlines various essential topics, such as pronunciation, common vocabulary, and useful phrases across different everyday situations, from commerce to family relations. This structured approach indicates that the book aims to equip learners with practical language skills that can be immediately applied in real-world contexts. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Spanish language -- Terms and phrases","Spanish language -- Textbooks for foreign speakers -- English"],"bookshelves":["Category: How To ...","Category: Language & Communication"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/41915.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/41915.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/41915.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/41915.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/41915.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/41915/pg41915.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/cache/epub/41915/pg41915-h.zip"},"download_count":2796},{"id":37806,"title":"Encyclopaedia Britannica, 11th Edition, \"Franciscans\" to \"French Language\": Volume 11, Slice 1","authors":[{"name":"Various","birth_year":null,"death_year":null}],"summaries":["\"Encyclopaedia Britannica, 11th Edition, 'Franciscans' to 'French Language'\" is a comprehensive reference work written in the early 20th century. This particular volume encompasses a range of historical and cultural topics, including the establishment of the Franciscan Order and details about various notable individuals and movements in history. It is designed to provide readers with a thorough understanding of key subjects, blending detailed accounts with informative entries.  The opening of this volume presents a detailed exploration of the Franciscans, a religious order founded by St. Francis of Assisi. It outlines their commitment to a life of poverty and service, detailing the inception of the order, its rapid expansion, and the internal conflicts that arose following St. Francis's death. The text highlights significant events, including the adoption of a formal rule and structure, and the tension between various factions within the order, such as the Zealots who sought to maintain strict adherence to St. Francis's original vision. This excerpt serves as a foundation for the extensive historical context surrounding the Franciscans, illustrating their lasting impact on both religious and social fronts. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Encyclopedias and dictionaries"],"bookshelves":["Category: Encyclopedias/Dictionaries/Reference","Category: History - Religious","Category: Religion/Spirituality"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/37806.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/37806.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/37806.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/37806.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/37806.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/37806/pg37806.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/files/37806/37806-8.zip"},"download_count":2666},{"id":77230,"title":"Family names from the Irish, Anglo-Saxon, Anglo-Norman and Scotch : $b Considered in relation to their etymology, with brief remarks on the history and languages of the peoples to whom we are indebted for their origin","authors":[{"name":"Gentry, Thomas G. (Thomas George)","birth_year":1843,"death_year":1905}],"summaries":[],"editors":[],"translators":[],"subjects":["Names, Personal -- Great Britain","Onomastics"],"bookshelves":[],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/77230.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/77230.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/77230.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/77230.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/77230.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/77230/pg77230.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/cache/epub/77230/pg77230-h.zip"},"download_count":2568},{"id":32856,"title":"Lectures on the Science of Language","authors":[{"name":"Müller, F. Max (Friedrich Max)","birth_year":1823,"death_year":1900}],"summaries":["\"Lectures on the Science of Language\" by F. Max Müller is a scientific publication written in the mid-19th century. This work consists of a series of lectures delivered at the Royal Institution of Great Britain, exploring the nature and evolution of language from a scientific perspective. The book aims to illuminate how language functions, its historical development, and its significance in human thought and society.  The beginning of this work introduces the overarching themes and objectives of the lectures. Müller reflects on his motivation to delve into the science of language, emphasizing its recent emergence as a field of study. He provides an overview of the challenges posed by the complexity of language and its historical transformations, arguing for the significance of understanding language as an essential aspect of human identity and knowledge. Müller outlines his intention to attract the attention of scholars from various fields to recognize the value of language science, asserting that it reveals profound insights into the human condition that go beyond mere words. This introduction sets the stage for a deeper exploration into the intricacies of language, positioning it as a vital area of inquiry within the broader context of human knowledge. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Comparative linguistics","Language and languages"],"bookshelves":["Category: Language & Communication"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/32856.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/32856.epub3.images","application/pdf":"https://www.gutenberg.org/files/32856/32856-pdf.pdf","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/32856.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/32856.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/32856.rdf","application/prs.tei":"https://www.gutenberg.org/files/32856/32856-tei/32856-tei.tei","image/jpeg":"https://www.gutenberg.org/cache/epub/32856/pg32856.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/files/32856/32856-0.zip"},"download_count":2159},{"id":67363,"title":"The Theory of Moral Sentiments: Or, an Essay Towards an Analysis of the Principles by Which Men Naturally Judge Concerning the Conduct and Character, First of Their Neighbours, and Afterwards of Themselves. to Which Is Added, a Dissertation on the Origin of Languages.","authors":[{"name":"Smith, Adam","birth_year":1723,"death_year":1790}],"summaries":["\"The Theory of Moral Sentiments\" by Adam Smith is a philosophical treatise written in the mid-18th century. The book explores the principles that govern human morality, particularly focusing on how individuals judge the conduct and character of themselves and others. It delves into concepts such as sympathy, propriety of actions, and the moral feelings that arise in social interactions.  At the start of the work, Smith introduces the foundational idea that human beings possess inherent principles that make them care about the well-being of others, attributing it to emotions like pity and compassion. He argues that people assess the emotions and actions of others through the lens of their own feelings and experiences. The opening chapters articulate how sympathy operates in understanding both joy and sorrow, laying the groundwork for his detailed analysis of moral sentiments and behaviors throughout the text. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Ethics -- Early works to 1800","Language and languages -- Early works to 1800"],"bookshelves":["Category: Philosophy & Ethics"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/67363.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/67363.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/67363.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/67363.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/67363.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/67363/pg67363.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/cache/epub/67363/pg67363-h.zip"},"download_count":2066},{"id":53038,"title":"Language: Its Nature, Development and Origin","authors":[{"name":"Jespersen, Otto","birth_year":1860,"death_year":1943}],"summaries":["\"Language: Its Nature, Development and Origin\" by Otto Jespersen is a scientific publication written in the early 20th century. This work delves into the complexities of language, discussing its historical evolution and its fundamental nature as a human construct. Jespersen aims to provide insights into how languages develop over time and the role of individuals and societies in shaping their use.  The opening of the book introduces the foundational concepts of linguistic science, emphasizing the importance of viewing language as a dynamic system that evolves rather than a static entity. Jespersen critiques metaphorical interpretations of language, asserting it is a function of human social activity rather than a living organism. He outlines his approach to studying language development, including insights into how a child learns their mother tongue and the influence of foreign languages and individuals on the evolution of speech. Jespersen highlights historical perspectives and previous linguists' contributions, setting the stage for a thorough exploration of the historical and biological dimensions of language development. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Language and languages"],"bookshelves":["Category: Language & Communication"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/53038.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/53038.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/53038.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/53038.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/53038.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/53038/pg53038.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/cache/epub/53038/pg53038-h.zip"},"download_count":2030},{"id":70458,"title":"Primitive culture, vol. 1 (of 2) : $b Researches into the development of mythology, philosophy, religion, language, art, and custom","authors":[{"name":"Tylor, Edward B. (Edward Burnett)","birth_year":1832,"death_year":1917}],"summaries":["\"Primitive Culture, vol. 1\" by Edward B. Tylor is a scientific publication written in the late 19th century. This work embarks on an extensive exploration into the development of human culture, touching upon facets such as mythology, religion, language, art, and societal customs. Tylor's research aims to uncover the interconnectedness of various cultural phenomena throughout history, suggesting that contemporary societies can be understood by studying their primitive counterparts.  At the start of the book, Tylor sets the stage for his discussion on culture by defining it in broad terms—encompassing knowledge, belief, art, morals, and customs acquired by humans as social beings. He emphasizes the importance of viewing human behavior in light of natural laws and continuity, arguing against notions of supernatural interference in cultural progress. Tylor highlights the significant role of ethnography in classifying and interpreting cultural practices across different societies, advocating for a systematic study of human evolution as it relates to civilization's development from primitive states to modern societies. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Animism","Civilization -- History","Ethnology","Language and languages","Mythology","Prehistoric peoples","Religion","Social evolution"],"bookshelves":["Category: Archaeology & Anthropology","Category: Philosophy & Ethics","Category: Religion/Spirituality"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/70458.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/70458.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/70458.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/70458.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/70458.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/70458/pg70458.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/files/70458/70458-0.zip"},"download_count":2002},{"id":71779,"title":"The language of flowers : $b The floral offering ; a token of affection and esteem ; comprising the language and poetry of flowers","authors":[{"name":"Dumont, Henrietta","birth_year":null,"death_year":null}],"summaries":["\"The Language of Flowers: The Floral Offering; a Token of Affection and Esteem\" by Henrietta Dumont is a collection that blends poetry and botanical knowledge, likely written in the mid-19th century. This work explores the intricate meanings and symbolisms behind various flowers, presenting a unique language that conveys human emotions and sentiments. Through illustrated entries, it aims to deepen readers' appreciation for nature and the emotional connections that flowers foster in personal relationships.  The opening of the volume begins with a thoughtful preface that poses existential questions about the significance of flowers in human lives, setting a philosophical tone. It highlights the idea that flowers possess inherent meanings that resonate with our emotions—from love and hope to grief and betrayal. Following this thematic introduction, the text transitions into a dictionary-like format that defines individual flowers and their meanings, accompanied by poetic excerpts that illustrate these associations. For example, the Snowdrop signifies hope, while the Marigold represents grief, blending natural beauty with emotional insights and inviting readers to contemplate their personal connections with these symbols. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Flower language","Flowers in literature"],"bookshelves":["Category: Encyclopedias/Dictionaries/Reference","Category: Nature/Gardening/Animals","Category: Poetry"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/71779.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/71779.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/71779.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/71779.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/71779.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/71779/pg71779.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/cache/epub/71779/pg71779-h.zip"},"download_count":1908},{"id":52230,"title":"Catalogue of the Manuscripts in the Spanish Language in the British Museum. Vol. 4","authors":[{"name":"Gayangos, Pascual de","birth_year":1809,"death_year":1897},{"name":"British Museum. Department of Manuscripts","birth_year":null,"death_year":null}],"summaries":["\"Catalogue of the Manuscripts in the Spanish Language in the British Museum\" by Don Pascual de Gayangos is a historical reference work written in the late 19th century. This extensive catalogue serves to document and classify various Spanish manuscripts housed in the British Museum, emphasizing their historical and cultural significance. It is particularly relevant for researchers, historians, and bibliophiles interested in the Spanish-speaking world and bibliographical history.  The opening of the manuscript presents a structured table of contents that outlines the various classes and topics covered in the fourth volume. It indicates a systematic organization, including categories such as Ecclesiastical History, private correspondence, and geographical works relating to Asia, Africa, and America. Moreover, there is an appendix detailing theological writings, belle letters, and historical documents, which suggests a comprehensive approach to the documentation of Spanish literary and historical heritage. This initial glimpse indicates the depth and breadth of the material contained within the catalogue, aimed at scholarly audiences. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Manuscripts -- Great Britain -- Catalogs","Manuscripts, Spanish -- Catalogs"],"bookshelves":["Category: Encyclopedias/Dictionaries/Reference"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/52230.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/52230.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/52230.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/52230.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/52230.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/52230/pg52230.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/cache/epub/52230/pg52230-h.zip"},"download_count":1903},{"id":41685,"title":"Encyclopaedia Britannica, 11th Edition, \"Latin Language\" to \"Lefebvre, François-Joseph\": Volume 16, Slice 3","authors":[{"name":"Various","birth_year":null,"death_year":null}],"summaries":["\"Encyclopaedia Britannica, 11th Edition, 'Latin Language' to 'Lefebvre' is a comprehensive reference work written in the early 20th century. This volume covers various aspects of the Latin language, its history, phonology, morphology, and syntax, as well as its relationship with other languages. The contents are likely aimed at readers interested in linguistics, classical studies, and the historical progression of languages.  The opening of this work delves into the origins and early records of the Latin language, situated in Rome around the 6th or 7th century B.C. It discusses the geographical extent of Latin during that time and centers on the earliest inscriptions that provide insight into its development. Additionally, it explores relationships between Latin and other Italic languages, emphasizing the linguistic transformations and shifts that influenced its grammar and phonetics over time.\" (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Encyclopedias and dictionaries"],"bookshelves":["Category: Encyclopedias/Dictionaries/Reference","Category: Language & Communication"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/41685.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/41685.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/41685.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/41685.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/41685.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/41685/pg41685.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/cache/epub/41685/pg41685-h.zip"},"download_count":1861},{"id":21197,"title":"Diego Collado's Grammar of the Japanese Language","authors":[{"name":"Collado, Diego","birth_year":null,"death_year":1638}],"summaries":["\"Diego Collado's Grammar of the Japanese Language\" by Diego Collado is a scholarly publication written in the early 17th century. This work serves as a grammar guide to the Japanese language, aiming to assist missionaries and scholars in understanding and communicating in colloquial Japanese. It is positioned as an essential tool in the history of Japanese linguistics, particularly significant during the time of European missionary efforts in Japan.  The opening of this grammar details its purpose: to provide a practical overview of the Japanese language tailored for those involved in missionary work. Collado references previous works on Japanese grammar by Father João Rodriguez, elaborating on how his own grammar is a simplified and more accessible restatement for students. The initial sections focus on the structure of the language, phonological considerations, and important grammatical attributes while illustrating foundational elements through examples designed to facilitate learning and application. This establishes the groundwork for understanding the intricacies of Japanese and its relevance in the context of religious discourse at the time. (This is an automatically generated summary.)"],"editors":[],"translators":[{"name":"Spear, Richard L.","birth_year":null,"death_year":null}],"subjects":["Japanese language -- Grammar"],"bookshelves":["Category: History - Religious","Category: Language & Communication"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/21197.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/21197.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/21197.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/21197.txt.utf-8","application/octet-stream":"https://www.gutenberg.org/files/21197/21197-page-images/f001.png","application/rdf+xml":"https://www.gutenberg.org/ebooks/21197.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/21197/pg21197.cover.medium.jpg"},"download_count":1649},{"id":35306,"title":"Encyclopaedia Britannica, 11th Edition, \"English Language\" to \"Epsom Salts\": Volume 9, Slice 6","authors":[{"name":"Various","birth_year":null,"death_year":null}],"summaries":["\"Encyclopaedia Britannica, 11th Edition, 'English Language' to 'Epsom Salts'\" is a reference work that compiles a vast array of information across multiple subjects, likely written in the early 20th century. This specific volume covers topics ranging from the evolution and structure of the English language to entries detailing various aspects of literature, law, and specific terms related to arts and sciences.   At the start of the work, the text presents a thorough introduction to the historical development of the English language, outlining its major stages—Old, Middle, and Modern English. It discusses the influence of various groups, including the Anglo-Saxons and later the Normans, on the language's evolution, emphasizing how different dialects emerged and how English absorbed vocabulary from other languages throughout its history. The detailed examination of linguistic changes sets up a broad context for understanding the richness and complexity of the English language as it continues to evolve. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Encyclopedias and dictionaries"],"bookshelves":["Category: Encyclopedias/Dictionaries/Reference"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/35306.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/35306.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/35306.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/35306.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/35306.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/35306/pg35306.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/files/35306/35306-8.zip"},"download_count":1648},{"id":14437,"title":"Historical View of the Languages and Literature of the Slavic Nations: With a Sketch of Their Popular Poetry","authors":[{"name":"Talvj","birth_year":1797,"death_year":1870}],"summaries":["\"Historical View of the Languages and Literature of the Slavic Nations\" by Talvj is a scholarly account produced in the mid-19th century, specifically around 1850. This work aims to provide a comprehensive overview of the languages and literature of the Slavic peoples, highlighting their historical development, cultural influences, and the impact of Christianity on their written traditions.   The opening of the book introduces the reader to the historical context and significance of Slavic languages and literature. It discusses the early origins of the Slavic nations, mentioning difficulties faced by historians in uncovering their past due to limited direct records. Emphasizing the need for a more accessible resource on this subject, the author justifies the book as a necessary contribution to English literature, stressing the vast cultural richness among Slavic populations that, at the time, numbered around seventy million. Through various chapters, the work will delve into specific languages, dialects, and literary traditions, focusing on important milestones and figures like Cyril and Methodius, who played a pivotal role in the development of Slavic literacy. Overall, the book serves to enrich the understanding of Slavic intellectual culture within the broader tapestry of European history. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Folk songs, Slavic","Slavic languages -- History","Slavic literature -- History and criticism"],"bookshelves":["Category: History - European","Category: Language & Communication","Category: Literature - Other"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/14437.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/14437.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/14437.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/14437.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/14437.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/14437/pg14437.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/cache/epub/14437/pg14437-h.zip"},"download_count":1621},{"id":33406,"title":"Heath's Modern Language Series: Spanish Short Stories","authors":[],"summaries":["\"Heath's Modern Language Series: Spanish Short Stories\" edited by Elijah Clarence Hills and Louise Reinhardt is a collection of short stories written in the late 19th to early 20th century. This compilation features narratives primarily centered around the realities of modern Spain, showcasing the cultural and social intricacies of the time through the works of noted Spanish authors. The stories are presented in an order of difficulty and include a blend of realistic and occasional supernatural elements, reflecting the literary movements of their era.  At the start of the collection, the opening narrative introduces the character Don Elías, who describes a night that spiraled into chaos when he inadvertently kills a man during an encounter with a group of drunken individuals. His initial panic and subsequent realization—that he has unintentionally killed someone—leads to a deep introspection about his actions and the consequences he might face. The tone oscillates between humor and seriousness, revealing not only the absurdity of the situation but also the underlying tensions of fear and guilt in a rapidly changing Spain. The story sets the stage for the exploration of personal identity and societal norms that is likely to permeate the subsequent tales in this anthology. (This is an automatically generated summary.)"],"editors":[{"name":"Hills, E. C. (Elijah Clarence)","birth_year":1867,"death_year":1932},{"name":"Reinhardt, Louise","birth_year":1866,"death_year":null}],"translators":[],"subjects":["Spanish language -- Readers","Spanish language -- Textbooks for foreign speakers -- English"],"bookshelves":["Category: Short Stories"],"languages":["es"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/33406.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/33406.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/33406.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/33406.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/33406.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/33406/pg33406.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/files/33406/33406-8.zip"},"download_count":1600},{"id":40521,"title":"An Etymological Dictionary of the Scottish Language: in which the words are explained in their different senses, authorized by the names of the writers by whom they are used, or the titles of the works in which they occur, and deduced from their originals","authors":[{"name":"Jamieson, John","birth_year":1759,"death_year":1838}],"summaries":["\"An Etymological Dictionary of the Scottish Language\" by John Jamieson is a linguistic reference work written in the early 19th century. This dictionary serves as an abridged edition of a previously published two-volume work from 1808, focusing on Scottish terms and their meanings, usages, and etymologies. The book is aimed at helping readers understand the varied senses of words in the Scottish vernacular, which includes words that might have different usages compared to standard English.   The opening of the dictionary presents an introductory note that outlines its purpose and structure, explaining that it incorporates terms found in Scottish literature and contextualizes them with authorship references. It mentions that while the dictionary aims to be comprehensive, some entries may be out of sequence or undefined, highlighting the rich but complex nature of the Scottish linguistic landscape. Moreover, it acknowledges the fluidity of spelling in Scottish words, suggesting that variations reflect historical linguistic developments in Scotland. Overall, the beginning establishes the groundwork for a detailed exploration of the Scottish language and its unique attributes. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Scots language -- Etymology -- Dictionaries"],"bookshelves":["Category: Encyclopedias/Dictionaries/Reference","Category: Language & Communication"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/40521.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/40521.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/40521.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/40521.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/40521.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/40521/pg40521.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/cache/epub/40521/pg40521-h.zip"},"download_count":1536},{"id":41975,"title":"A Dictionary of the First or Oldest Words in the English Language: From the Semi-Saxon Period of A.D. 1250 to 1300","authors":[{"name":"Coleridge, Herbert","birth_year":1830,"death_year":1861}],"summaries":["\"A Dictionary of the First or Oldest Words in the English Language\" by Herbert Coleridge is a scholarly dictionary written in the mid-19th century. This work serves as a comprehensive inventory of every word found in the printed English literature of the 13th century, aiming to establish a historical perspective on the evolution of the English language. The book is likely to attract linguists, philologists, and those interested in the historical development of English vocabulary.  The opening of the dictionary begins with a preface where Coleridge outlines the purpose and significance of the work. He emphasizes that the dictionary aims to provide a foundational resource for the Philological Society's larger project of compiling an English dictionary. In this section, he notes how the words are organized, detailing the approach taken to illustrate both older forms and modern equivalents, along with the systematic referencing of etymological roots. The introduction also acknowledges contributions from various scholars, highlighting a collaborative effort toward documenting the lexicon of early English literature and its historical context. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["English language -- Middle English, 1100-1500 -- Glossaries, vocabularies, etc."],"bookshelves":["Category: Encyclopedias/Dictionaries/Reference","Category: History - British","Category: Language & Communication"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/41975.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/41975.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/41975.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/41975.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/41975.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/41975/pg41975.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/cache/epub/41975/pg41975-h.zip"},"download_count":1500},{"id":38143,"title":"Encyclopaedia Britannica, 11th Edition, \"Grasshopper\" to \"Greek Language\": Volume 12, Slice 4","authors":[{"name":"Various","birth_year":null,"death_year":null}],"summaries":["\"Encyclopaedia Britannica, 11th Edition, 'Grasshopper' to 'Greek Language'\" is a scientific publication written in the early 20th century. This volume serves as a comprehensive dictionary of arts, sciences, literature, and general information, providing detailed entries on a wide range of topics, from zoology to linguistics. The content likely includes explanations of various subjects, including the biology of grasshoppers, historical figures, types of art, and aspects of the Greek language.  The opening of this volume presents a meticulous collection of articles, starting with detailed taxonomic descriptions of grasshoppers and various related insects, emphasizing their physical characteristics and behaviors. Following this, it covers topics like the grass of Parnassus in botany, features of the domestic grate and its historical relevance, and biographical sketches of notable figures such as the Roman Emperor Gratian. Each entry is structured to provide concise yet informative insights into the respective subjects, reflecting the encyclopedic aim of offering a wide array of knowledge to the reader. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Encyclopedias and dictionaries"],"bookshelves":["Category: Encyclopedias/Dictionaries/Reference"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/38143.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/38143.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/38143.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/38143.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/38143.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/38143/pg38143.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/files/38143/38143-8.zip"},"download_count":1483},{"id":34902,"title":"Basque Legends; With an Essay on the Basque Language","authors":[{"name":"Webster, Wentworth","birth_year":1829,"death_year":1907}],"summaries":["\"Basque Legends; With an Essay on the Basque Language\" by Wentworth Webster is a collection of traditional tales and folklore from the Basque region, written in the late 19th century. The book explores the unique mythology and cultural narratives of the Basques, including legendary creatures such as the Tartaro and the Heren-Suge, as well as various animal fables. It offers an intriguing look into the Basque societal values and linguistic elements, making it a valuable resource for anthropology and folklore enthusiasts.  At the start of the work, the introduction emphasizes the significance of studying comparative mythology and highlights the Basque people’s distinct cultural heritage, characterized by their unwritten language and rich oral traditions. The opening portion sets the stage for the stories to come, revealing how these legends—believed to represent ancient truths—are recounted by Basque peasants during communal activities. The narratives intertwine historical influences and local beliefs, depicting characters like the one-eyed Tartaro and heroic figures enmeshed in quests and adventures, illustrating themes of cleverness, survival, and the interplay of the familiar with the supernatural. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Basque language","Basques -- Folklore"],"bookshelves":["Category: Mythology, Legends & Folklore"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/34902.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/34902.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/34902.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/34902.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/34902.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/34902/pg34902.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/files/34902/34902-0.zip"},"download_count":1427},{"id":70484,"title":"Primitive culture, vol. 2 (of 2) : $b Researches into the development of mythology, philosophy, religion, language, art, and custom","authors":[{"name":"Tylor, Edward B. (Edward Burnett)","birth_year":1832,"death_year":1917}],"summaries":["\"Primitive Culture, vol. 2\" by Edward B. Tylor is a scientific publication written in the early 20th century. This volume continues the exploration of the evolution of human belief systems, focusing particularly on animism and related concepts regarding the soul's existence, transmigration, and the practices surrounding death and the afterlife. The book delves into the historical and cultural development of these beliefs across different societies, aiming to understand the shared human experiences reflected in mythology, religion, and customs.  The opening of this volume establishes a foundation for discussing animism, introducing the concept of the soul's continued existence after death. Tylor outlines two main doctrines—transmigration, the rebirth of souls into new bodies, and the idea of the independent existence of the soul in a future life—while examining their prevalence in various cultural beliefs. He begins by analyzing how these doctrines are connected to the lower levels of human culture, exploring examples from different tribes and societies that illustrate how these animistic beliefs manifest in practices such as feasting for the dead and the perceived connections between ancestors and the living. This examination sets the stage for more detailed inquiries into specific beliefs and practices that span a wide range of human experience. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Animism","Civilization -- History","Ethnology","Language and languages","Mythology","Prehistoric peoples","Religion","Social evolution"],"bookshelves":["Category: Archaeology & Anthropology","Category: Mythology, Legends & Folklore","Category: Religion/Spirituality"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/70484.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/70484.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/70484.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/70484.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/70484.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/70484/pg70484.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/files/70484/70484-0.zip"},"download_count":1415},{"id":43123,"title":"The Native Races [of the Pacific states], Volume 3, Myths and Languages: The Works of Hubert Howe Bancroft, Volume 3","authors":[{"name":"Bancroft, Hubert Howe","birth_year":1832,"death_year":1918}],"summaries":["\"The Native Races [of the Pacific states], Volume 3, Myths and Languages\" by Hubert Howe Bancroft is a scientific publication written in the late 19th century. This volume delves into the rich tapestry of myths and linguistic diversity among the indigenous peoples of the Pacific states, exploring the origins of language, mythology, and the spiritual beliefs embedded in their cultures. It serves as a comprehensive study of how these elements interconnect and contribute to a deeper understanding of human civilization.  The opening of the work sets the stage for a profound examination of the distinctions between humans and animals, establishing the significance of language as a unique attribute of humanity. Bancroft discusses the evolution of language and mythology, exploring theories of their origins and how they reflect the intellectual and spiritual lives of early peoples. He emphasizes the necessity of language in cultural development and how myths serve as a means to explain the mysteries of existence, thereby providing insight into the philosophies and belief systems of the Pacific states' native races. Through this exploration, he lays the groundwork for deeper analysis in subsequent chapters, which promise to elucidate the diverse linguistic elements and mythological narratives present among various indigenous groups. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Indians -- Bibliography","Indians of Central America","Indians of Mexico","Indians of North America -- Pacific Coast of North America"],"bookshelves":["Category: Archaeology & Anthropology","Category: Language & Communication","Category: Mythology, Legends & Folklore"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/43123.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/43123.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/43123.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/43123.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/43123.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/43123/pg43123.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/cache/epub/43123/pg43123-h.zip"},"download_count":1397},{"id":21665,"title":"A Brief History of the English Language and Literature, Vol. 2","authors":[{"name":"Meiklejohn, J. M. D. (John Miller Dow)","birth_year":1830,"death_year":1902}],"summaries":["\"A Brief History of the English Language and Literature, Vol. 2\" by J. M. D. Meiklejohn is a historical account written in the late 19th century. This volume serves as a continuation of the author's examination of English, delving into its history and the evolution of English literature. The text is likely aimed at students and educators, highlighting the significant developments in the language over time.  The opening of the book outlines the author's intentions and the structure of the work. It emphasizes that language is an organic entity that evolves over time, both in spoken and written forms. It discusses the early beginnings of the English language, tracing its roots back to the Anglo-Saxon period and the influences that shaped its development, including the impact of various invasions and cultural interactions. Through a comprehensive introduction, Meiklejohn sets the stage for a deeper exploration of the vocabulary and grammar of English, as well as the historical context of its literary contributions, making it apparent that the book aims to provide a thorough understanding of the English language's past. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["English language -- History","English literature -- History and criticism"],"bookshelves":["Category: British Literature","Category: History - British","Category: Language & Communication"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/21665.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/21665.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/21665.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/21665.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/21665.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/21665/pg21665.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/files/21665/21665-0.zip"},"download_count":1365},{"id":27977,"title":"Austral English : $b A dictionary of Australasian words, phrases and usages with those aboriginal-Australian and Maori words which have become incorporated in the language, and the commoner scientific words that have had their origin in Australasia","authors":[{"name":"Morris, Edward Ellis","birth_year":1843,"death_year":1901}],"summaries":["\"Austral English\" by Edward Ellis Morris is a dictionary of Australasian words, phrases, and usages written in the late 19th century. The work compiles the unique vocabulary that has developed in Australasia, including the contributions of Aboriginal Australian and Māori languages, as well as scientific terms that have originated in the region. The overall aim of the dictionary is to highlight the distinctive features of the English language as it is spoken in Australia, Tasmania, and New Zealand.  The opening of \"Austral English\" introduces the origin of the work, stemming from a request by Dr. James Murray to contribute local vernacular to the Oxford English Dictionary. Morris provides a historical context, mentioning the perceived inadequacies of existing dictionaries in capturing the nuances of Australasian English while outlining his methodology for collecting words and phrases. He emphasizes the necessity of documenting not only new words but also the local adaptations of English terms that arise from the unique flora, fauna, and cultural influences of the region. This serves to establish the importance of this dictionary as a significant linguistic resource, bridging connections between various languages and the English vernaculars adopted in Australasia. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Australian languages -- Influence on English -- Dictionaries","English language -- Australasia -- Dictionaries","English language -- Australia -- Dictionaries","English language -- Foreign words and phrases -- Maori","English language -- New Zealand -- Dictionaries","Maori language -- Influence on English -- Dictionaries"],"bookshelves":["Australia","Category: Encyclopedias/Dictionaries/Reference","Category: Language & Communication","New Zealand"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/27977.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/27977.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/27977.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/27977.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/27977.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/27977/pg27977.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/files/27977/27977.zip"},"download_count":1252},{"id":53094,"title":"Outline of the history of the English language and literature","authors":[{"name":"Anonymous","birth_year":null,"death_year":null}],"summaries":["\"Outline of the History of the English Language and Literature\" by Anonymous is a historical account likely written in the late 19th century. The work aims to provide a comprehensive overview of the evolution of the English language and its literature from its formative roots to contemporary usage. It serves as an introductory guide for students and enthusiasts interested in the study of English philology.  The opening of the text discusses the primary purpose of the work, which is to shed light on the history and development of the English language and its literature, beginning with early linguistical foundations and cultural influences. The preface suggests that the text is structured to not only present facts but also to ignite interest in the subject matter by engaging readers with both the language's historical context and the significant authors who have contributed to its evolution. The author clearly outlines the intended audience, indicating that the text is suitable for various educational levels and for self-study, making it accessible for a wide range of readers. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["English language -- History","English literature -- History and criticism"],"bookshelves":["Category: History - British","Category: Language & Communication","Category: Teaching & Education"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/53094.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/53094.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/53094.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/53094.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/53094.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/53094/pg53094.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/cache/epub/53094/pg53094-h.zip"},"download_count":1213},{"id":30560,"title":"Music: An Art and a Language","authors":[{"name":"Spalding, Walter Raymond","birth_year":1865,"death_year":1962}],"summaries":["\"Music: An Art and a Language\" by Walter Raymond Spalding is a scholarly publication written in the early 20th century. The work focuses on the appreciation of music, exploring its grammar and structure to foster a deeper understanding and love of the art form. It aims to guide readers in grasping music's complexities and its emotional and intellectual powers, encouraging active engagement rather than passive enjoyment.  The opening portion of the book emphasizes the elusive nature of music, asserting that while it can provoke deep emotional responses, it resists definitive definitions. Spalding discusses important elements like rhythm and sound, highlighting that music functions as a language of emotional expression. The text suggests methods for listeners to develop their musical understanding, stressing the importance of familiarity and intellectual engagement with compositions to truly appreciate their richness and depth. Furthermore, the author provides insights into the foundational concepts of music, including musical grammar and the significance of overall structure, setting the stage for more detailed exploration in subsequent chapters. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Music appreciation","Musical form"],"bookshelves":["Category: Art","Category: Music","Music"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/30560.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/30560.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/30560.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/30560.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/30560.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/30560/pg30560.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/files/30560/30560-8.zip"},"download_count":1195},{"id":40617,"title":"The Teaching and Cultivation of the French Language in England during Tudor and Stuart Times: With an Introductory Chapter on the Preceding Period","authors":[{"name":"Lambley, K. Rebillon (Kathleen Rebillon)","birth_year":null,"death_year":null}],"summaries":["\"The Teaching and Cultivation of the French Language in England during Tudor and Stuart Times\" by Kathleen Lambley is a historical account written in the early 20th century. This scholarly work explores the evolution and methods of teaching the French language in England during the Tudor and Stuart periods, emphasizing its significance in education and society during those times. The book likely focuses on the formalization of French instruction, its societal status, and the interplay between language and culture in England.  The opening of the text introduces the author's objective: to trace the history of French language teaching in England, particularly between significant historical events that impacted the French language's status. Lambley discusses the early influences and educational practices that laid the groundwork for French instruction, highlighting the contributions of notable figures such as John Palsgrave, who recognized the importance of formalizing French grammar for English speakers. Additionally, references are made to the pedagogical tools of the time and the gradual shift in societal perceptions of the language, setting a foundation for the in-depth examination of the topic in subsequent chapters. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["French language -- Study and teaching","French language -- Study and teaching -- Bibliography","Learning and scholarship -- England"],"bookshelves":["Category: History - British","Category: Language & Communication","Category: Teaching & Education"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/40617.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/40617.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/40617.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/40617.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/40617.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/40617/pg40617.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/cache/epub/40617/pg40617-h.zip"},"download_count":1140}]}