{"count":3,"next":null,"previous":null,"results":[{"id":64488,"title":"Roman Stoicism: being lectures on the history of the Stoic philosophy with special reference to its development within the Roman Empire","authors":[{"name":"Arnold, Edward Vernon","birth_year":1857,"death_year":1926}],"summaries":["\"Roman Stoicism\" by Edward Vernon Arnold is a scholarly examination of Stoic philosophy, particularly its development within the Roman Empire, written in the early 20th century. The text offers a thorough exploration of Stoicism's historical significance, philosophical doctrines, and its influence on later thought and religions. By framing Stoicism as a vital link between ancient and modern philosophies, Arnold emphasizes its relevance to contemporary discussions of morality and governance.  The opening of the work outlines the foundational premises of Stoicism and situates it within the broader context of world religions. Arnold begins by explaining how Roman literature reflects deep philosophical inquiries characteristic of the Stoics, particularly concerning fate, morality, and the nature of the divine. He highlights the importance of understanding the interplay between these philosophical questions and the socio-political landscape of the Roman world. The author sets the stage for a detailed exploration of the Stoic philosophy's evolution, its interaction with other religious and philosophical traditions like Judaism and Christianity, and its enduring legacy in Western thought. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Stoics"],"bookshelves":["Category: History - Ancient","Category: Philosophy & Ethics","Category: Religion/Spirituality"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/64488.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/64488.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/64488.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/64488.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/64488.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/64488/pg64488.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/cache/epub/64488/pg64488-h.zip"},"download_count":663},{"id":7514,"title":"A Guide to Stoicism","authors":[{"name":"Stock, St. George William Joseph","birth_year":1850,"death_year":null}],"summaries":["\"A Guide to Stoicism\" by St. George William Joseph Stock is a philosophical treatise written in the early 20th century. This book serves as an exploration and interpretation of Stoicism, the ancient Greek philosophy founded by Zeno of Citium, which emphasizes rationality and virtue as central tenets for achieving a good life. The text reviews the foundations and key concepts of Stoicism, including ethics, logic, and physics, aiming to present the doctrines in an accessible manner.  In the book, Stock meticulously outlines the principles of Stoicism, discussing key figures such as Zeno and Chrysippus and their contributions to the philosophy. He delves into Stoic ethics, advocating the idea that virtue is the only true good and that external circumstances do not determine one’s happiness. The author also highlights the Stoic view of the universe as a rational and orderly entity governed by divine reason (Logos), asserting that human beings should align their lives with nature and pursue wisdom. Throughout the guide, Stock emphasizes the practical applications of Stoicism, advocating for a life led by reason and virtue above all else, thereby addressing both philosophical and everyday concerns for his readers. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Stoics"],"bookshelves":["Category: Philosophy & Ethics","Philosophy"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/7514.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/7514.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/7514.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/7514.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/7514.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/7514/pg7514.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/files/7514/7514.zip"},"download_count":584},{"id":19007,"title":"Danger signals : $b Remarkable, exciting and unique examples of the bravery, daring and stoicism in the midst of danger of train dispatchers and railroad engineers","authors":[{"name":"Hill, John A. (John Alexander)","birth_year":1858,"death_year":1916},{"name":"Brady, Jasper Ewing","birth_year":1866,"death_year":1940}],"summaries":["\"Danger Signals\" by John A. Hill and Jasper Ewing Brady is a collection of remarkable and exciting accounts showcasing the bravery and resilience of railroad dispatchers and engineers, written in the early 20th century. This work vividly recounts tales of men who faced perilous situations with indomitable courage, emphasizing both the personal and professional stakes involved in their line of work. Through a series of engaging stories, the authors highlight the themes of heroism and teamwork in the face of adversity.  The opening of \"Danger Signals\" introduces the character Jim Wainright, who reminisces about his experiences in the railroad industry. He recalls a poignant conversation with an old acquaintance, Jim Wainright, about a young fireman who was deeply connected to his life on the rails. As Wainright narrates his tale, he brings to life the spirit of camaraderie among crew members and the challenges they faced, including mentorship, loyalty, and unexpected tragedies. The narrative sets a gripping tone for the collection, inviting readers to delve deeper into the stories of courage that unfold throughout the book. (This is an automatically generated summary.)"],"editors":[],"translators":[],"subjects":["Railroad stories"],"bookshelves":["Category: Adventure","Category: Short Stories"],"languages":["en"],"copyright":false,"media_type":"Text","formats":{"text/html":"https://www.gutenberg.org/ebooks/19007.html.images","application/epub+zip":"https://www.gutenberg.org/ebooks/19007.epub3.images","application/x-mobipocket-ebook":"https://www.gutenberg.org/ebooks/19007.kf8.images","text/plain; charset=us-ascii":"https://www.gutenberg.org/ebooks/19007.txt.utf-8","application/rdf+xml":"https://www.gutenberg.org/ebooks/19007.rdf","image/jpeg":"https://www.gutenberg.org/cache/epub/19007/pg19007.cover.medium.jpg","application/octet-stream":"https://www.gutenberg.org/cache/epub/19007/pg19007-h.zip"},"download_count":438}]}